{
    "appHeader": "George Knap",
    "languages": {
        "en": "English",
        "cs": "Čeština"
    },
    "appUpdate": {
        "question": "K dispozici je nová verze aplikace. Aktualizace může chvíli trvat a bude následována znovunačtením okna prohlížeče. Chcete nyní aktualizaci provést?",
        "title": "Nová verze aplikace"
    },
    "shared": {
        "failureMessage": "Oops! Operace neočekávaně selhala.",
        "noResultsFound": "Žádná data",
        "cancel": "Zrušit změny",
        "save": "Uložit",
        "yes": "Ano",
        "no": "Ne",
        "invalidInput": "nevalidní pole",
        "unauthorized": "Uživatel není přihlášen nebo vypršela platnost přihlášení.",
        "loginFailed": "Neplatné uživatelské jméno nebo heslo.",
        "serverError": "Chyba serveru nebo server není dostupný.",
        "commonConfirmationQuestion": "Jste si jisti, že chcete tuto akci provést?",
        "position": "Poloha",
        "clearForm": "Vyčistit formulář",
        "unsavedChanges": "Máte neuložené změny. Opravdu zrušit?"
    },
    "menu": {
        "resetGridster": "Obnovit polohu karet",
        "language": "Změnit jazyk"
    },
    "aboutMe": {
        "subtitle": "Není tak složité psát čisté a elegantní webové aplikace",
        "age": "Věk",
        "email": "E-mail",
        "phone": "Telefon",
        "years": "let",
        "technologies": "Expert na",
        "messenger": "Kontaktovat na Facebook Messenger",
        "linkedin": "LinkedIn profil"
    },
    "employmentHistory": {
        "title": "Přehled pracovních zkušeností",
        "freelancer": {
            "range": "2017 - dosud",
            "company": "Freelancer pro vývoj Progressive Web Apps",
            "p1": "Znáte pojem Progressive Web Apps? Jedná se o standard pro hybridní webové aplikace, které imitují chování nativních mobilních apliakcí a lze je na mobilní zařízení nainstalovat, podobně jako aplikace z app store.",
            "p2": "Progressive Web Apps disponují základní schopností práce v offline režimu a jsou multiplatformní. Mám rozsáhlé zkušenosti v oblasti vývoje Progressive Web Apps v cutting edge technologiích jako je platforma Angular, RxJS, Redux, Angular Material, Firebase a Ag-Grid.",
            "p3": "Neváhejte mě kontaktovat a vytvořím pro Vaši společnost aplikaci, kterou potřebujete. V případě jakýcholiv dotazů Vám velmi rád poskytnu nezávaznou konzultaci."
        },
        "veropath": {
            "range": "2014 - 2015",
            "company": "Veropath",
            "locationKey": "Místo",
            "locationValue": "Edinburg - UK",
            "positionKey": "Pozice",
            "positionValue": "AngularJS Developer",
            "p1": "Ve společnosti Veropath jsem byl součástí týmu vývoje webového systému pro analýzu telefonních nákladů.",
            "skills": "Dovednosti"
        },
        "intens": {
            "range": "od 2016",
            "company": "INTENS Corporation",
            "locationKey": "Místo",
            "locationValue": "Praha",
            "positionKey": "Pozice",
            "positionValue": "Angular platform Lead Developer & Technical Lead",
            "p1": "V INTENS Corporation jsem zodpovědný za frontend vývoj webových aplikací na platformě Angular a starším AngularJS. Má role je Technical Lead - jsem zodpovědný za návrh použitých technologií a architekturu aplikací. Tyto webové aplikace komunikují prostřednictvím ServiceStack API s .NET servery. Pro realtime zobrazení dat využívám technologii Server-Sent Events. Jsem také zodpovědný za zaškolení junior kolegů",
            "p2": "Aplikace spadají do oblasti dopravní telematiky a GIS systémů  (Geographic Information Systems).",
            "skills": "Dovednosti"
        },
        "pscp": {
            "range": "2010 - 2014",
            "company": "Penzijní společnost České Pojišťovny",
            "locationKey": "Místo",
            "locationValue": "Praha",
            "positionKey": "Pozice",
            "positionValue": "T-SQL developer, později C# Developer",
            "p1": "V PSČP jsem zastával roli programátora interní aplikace pro správu penzijních účtů. Do roku 2013 jsem převážně psal T-SQL procedury a vyvíjel systém v prostředí PowerBuilder.",
            "p2": "Od roku 2013 jsem se zapojil do vývoje nového penzijního systému v C#/.NET 4.5",
            "skills": "Dovednosti"
        }
    },
    "education": {
        "title": "Vzdělání",
        "name": "2006 - 2010 Bakalářský titul v programu Aplikovaná informatika",
        "university": "Vysoká škola ekonomická v Praze",
        "award": "Bakalářský titul",
        "p1": "Na Fakultě informatiky a statistiky jsem získal základní znalosti objektově orientovaného programování. Jako specializaci jsem si zvolil databáze. Splnil jsem kurzy SQL/T-SQL, architektury relačních databázových systémů, návrhy databází a správu databáze Oracle.",
        "p2": "V posledním ročníku jsem absolvoval předměty vývoje webových stránek. Bakalářkou práci na téma \"Implemetace Platební brány PayPal v internetovém obchodě\" jsem složil a obhájil v roce 2010."
    }
}