{
    "appHeader": "George Knap",
    "languages": {
        "en": "English",
        "cs": "Čeština"
    },
    "appUpdate": {
        "question": "A new version is available. Required files will be downloaded which may take a moment. Page reload will follow when update is done. Would you like to update now?",
        "title": "New app version available"
    },
    "shared": {
        "failureMessage": "Oops! Something went wrong. Please try again later.",
        "noResultsFound": "No data",
        "cancel": "Cancel",
        "save": "Save",
        "yes": "Yes",
        "no": "No",
        "invalidInput": "Invalid",
        "unauthorized": "Unauthorized. Not logged in or the session has expired.",
        "loginFailed": "Invalid user name or password.",
        "serverError": "Server error or connection to server lost.",
        "commonConfirmationQuestion": "Are you sure to proceed?",
        "position": "Position",
        "clearForm": "Clear Form",
        "unsavedChanges": "You have an unsaved changes. Do you reallu want to proceed?"
    },
    "menu": {
        "resetGridster": "Restore Cards Positions",
        "language": "Toggle Language"
    },
    "aboutMe": {
        "subtitle": "It doesn't take much to make clean and elegant web solutions",
        "age": "Age",
        "email": "E-mail",
        "phone": "Phone Number",
        "years": "years old",
        "technologies": "Core Technologies",
        "messenger": "Contact me at Facebook Messenger",
        "linkedin": "LinkedIn profile"
    },
    "employmentHistory": {
        "title": "Employment History",
        "freelancer": {
            "range": "from 2017",
            "company": "Progressive Web Apps freelancer",
            "p1": "Have you heard about Progressive Web Apps? It's the standard for next generation hybrid apps that imitates the native mobile apps behavior without the need of downloading the app from the app store.",
            "p2": "The PWA features basic offline capability and cross-platform compatibility. I have decent experience creating Progressive Web Apps using the cutting edge technologies like Angular framework, Angular Material, Firebase, Redux and RxJS.",
            "p3": "Feel free to contact me with any question and I will create the app your company needs."
        },
        "veropath": {
            "range": "2014 - 2015",
            "company": "Veropath",
            "locationKey": "Location",
            "locationValue": "Edinburg - UK",
            "positionKey": "Position",
            "positionValue": "AngularJS Developer",
            "p1": "I was part of the team responsible for development of Telecoms Expense Management Web App.",
            "skills": "Skills"
        },
        "intens": {
            "range": "from 2016",
            "company": "INTENS Corporation",
            "locationKey": "Location",
            "locationValue": "Prague",
            "positionKey": "Position",
            "positionValue": "Angular platform Lead Developer & Technical Lead",
            "p1": "At INTENS Corporation I've been responsible for creating Angular & AngularJS Web Apps. My role is technical lead, I design the app's architecture and I decide the technologies to use at front-end side. My apps communicate via ServiceStack API with .NET servers. Server-Sent Events technology used for realtime data pushing. I've also been mentoring junior colleagues.",
            "p2": "Our products focus on transport telematics and GIS (Geographic Information Systems)",
            "skills": "Skills"
        },
        "pscp": {
            "range": "2010 - 2014",
            "company": "Česká Pojišťovna Pension Fund",
            "locationKey": "Location",
            "locationValue": "Prague",
            "positionKey": "Position",
            "positionValue": "T-SQL developer, později C# Developer",
            "p1": "At Pension Fund I was a developer of an application responsible for managing pension accounts. Between 2010-2013 I was creating T-SQL stored porcedures and application layer in PowerBuilder.",
            "p2": "From 2013 I joined a team to create new pension management system using C#/.NET 4.5",
            "skills": "Skills"
        }
    },
    "education": {
        "title": "Education",
        "name": "2006 - 2010 Bachelor's Degree at Apllied Informatics",
        "university": "University of Economics in Prague",
        "award": "Bachelor's Degree",
        "p1": "I learned basics of object oriented programming at the Faculty of Informatics and Statistics, University of Economics in Prague. I chose relational databases to be speacialty. I passed following courses SQL/T-SQL, architecture of relational database management systems, designing database structure and managing Oracle database.",
        "p2": "In my last yer at the university I passed web development courses. In 2010 I defended my Bachelor's thesis \"Implementing PayPal payment gateway.\""
    }
}